#pragma once
#include <iostream>

class Greeter
{
private:
	const std::string HELLO_STR = "Здравствуйте, ";
public:
	std::string greet(std::string);
};


/*
Создайте класс Greeter, который определяет один метод greet,
принимающий на вход строку и возвращающий строку с приветствием
значения той строки, которую ему передали.

Поместите этот класс в статическую библиотеку и воспользуйтесь
им из консольного приложения для приветствия пользователя, который введёт своё имя.

Здравствуйте, Владислав!
*/